---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.InvalidApparentPowerDensity
source: html/5997daf3-d704-ffeb-da55-4ed2b863b56b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.InvalidApparentPowerDensity Property

The Apparent Power Density is invalid. Edit the Power Density and/or Power Factor to recalculate the Apparent Power Density.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidApparentPowerDensity { get; }
```